mteter-upenn/ModbusGateway/mc_programs/arduino_ide_setup/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout
menu.ser_sz=Serial Buffer Size

teensy31.name=Teensy 3.2 / 3.1
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_data_size=65536
teensy31.upload.tool=teensyloader
teensy31.upload.protocol=halfkay
teensy31.build.board=TEENSY31
teensy31.build.core=teensy3
teensy31.build.mcu=mk20dx256
teensy31.build.warn_data_percentage=97
teensy31.build.toolchain=arm/bin/
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy31.build.flags.dep=-MMD
teensy31.build.flags.optimize=-Os
teensy31.build.flags.cpu=-mthumb -mcpu=cortex-m4 -fsingle-precision-constant
teensy31.build.flags.defs=-D__MK20DX256__ -DTEENSYDUINO=130
teensy31.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy31.build.flags.c=
teensy31.build.flags.S=-x assembler-with-cpp
teensy31.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk20dx256.ld"
teensy31.build.flags.libs=-larm_cortexM4l_math -lm
teensy31.serial.restart_cmd=false
teensy31.menu.usb.serial=Serial
teensy31.menu.usb.serial.build.usbtype=USB_SERIAL
teensy31.menu.usb.keyboard=Keyboard
teensy31.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensy31.menu.usb.keyboard.fake_serial=teensy_gateway
teensy31.menu.usb.touch=Keyboard + Touch Screen
teensy31.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensy31.menu.usb.touch.fake_serial=teensy_gateway
teensy31.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensy31.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensy31.menu.usb.hidtouch.fake_serial=teensy_gateway
teensy31.menu.usb.hid=Keyboard + Mouse + Joystick
teensy31.menu.usb.hid.build.usbtype=USB_HID
teensy31.menu.usb.hid.fake_serial=teensy_gateway
teensy31.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy31.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy31.menu.usb.midi=MIDI
teensy31.menu.usb.midi.build.usbtype=USB_MIDI
teensy31.menu.usb.midi.fake_serial=teensy_gateway
teensy31.menu.usb.serialmidi=Serial + MIDI
teensy31.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensy31.menu.usb.audio=Audio
teensy31.menu.usb.audio.build.usbtype=USB_AUDIO
teensy31.menu.usb.audio.fake_serial=teensy_gateway
teensy31.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensy31.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensy31.menu.usb.rawhid=Raw HID
teensy31.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy31.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31.menu.usb.flightsim=Flight Sim Controls
teensy31.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy31.menu.usb.flightsim.fake_serial=teensy_gateway
teensy31.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensy31.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy31.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
teensy31.menu.usb.everything=All of the Above
teensy31.menu.usb.everything.build.usbtype=USB_EVERYTHING
teensy31.menu.usb.disable=No USB
teensy31.menu.usb.disable.build.usbtype=USB_DISABLED
#uncomment these if you want to try faster overclocking
teensy31.menu.speed.168opt=168 MHz optimize speed (overclock)
teensy31.menu.speed.144opt=144 MHz optimize speed (overclock)
teensy31.menu.speed.96opt=96 MHz optimize speed (overclock)
teensy31.menu.speed.72opt=72 MHz optimize speed
teensy31.menu.speed.48opt=48 MHz optimize speed
teensy31.menu.speed.24opt=24 MHz optimize speed
teensy31.menu.speed.96=96 MHz reduce code size (overclock)
teensy31.menu.speed.72=72 MHz reduce code size
teensy31.menu.speed.48=48 MHz reduce code size
teensy31.menu.speed.24=24 MHz reduce code size
teensy31.menu.speed.16=16 MHz reduce code size (No USB)
teensy31.menu.speed.8=8 MHz reduce code size (No USB)
teensy31.menu.speed.4=4 MHz reduce code size (No USB)
teensy31.menu.speed.2=2 MHz reduce code size (No USB)
teensy31.menu.speed.120opt=120 MHz optimize speed (overclock)
teensy31.menu.speed.168opt.build.fcpu=168000000
teensy31.menu.speed.168opt.build.flags.optimize=-O
teensy31.menu.speed.168opt.build.flags.ldspecs=
teensy31.menu.speed.144opt.build.fcpu=144000000
teensy31.menu.speed.144opt.build.flags.optimize=-O
teensy31.menu.speed.144opt.build.flags.ldspecs=
teensy31.menu.speed.120opt.build.fcpu=120000000
teensy31.menu.speed.120opt.build.flags.optimize=-O
teensy31.menu.speed.120opt.build.flags.ldspecs=
teensy31.menu.speed.96opt.build.fcpu=96000000
teensy31.menu.speed.96opt.build.flags.optimize=-O
teensy31.menu.speed.96opt.build.flags.ldspecs=
teensy31.menu.speed.72opt.build.fcpu=72000000
teensy31.menu.speed.72opt.build.flags.optimize=-O
teensy31.menu.speed.72opt.build.flags.ldspecs=
teensy31.menu.speed.48opt.build.fcpu=48000000
teensy31.menu.speed.48opt.build.flags.optimize=-O
teensy31.menu.speed.48opt.build.flags.ldspecs=
teensy31.menu.speed.24opt.build.fcpu=24000000
teensy31.menu.speed.24opt.build.flags.optimize=-O
teensy31.menu.speed.24opt.build.flags.ldspecs=
teensy31.menu.speed.96.build.fcpu=96000000
teensy31.menu.speed.96.build.flags.optimize=-Os
teensy31.menu.speed.96.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.72.build.fcpu=72000000
teensy31.menu.speed.72.build.flags.optimize=-Os
teensy31.menu.speed.72.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.48.build.fcpu=48000000
teensy31.menu.speed.48.build.flags.optimize=-Os
teensy31.menu.speed.48.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.24.build.fcpu=24000000
teensy31.menu.speed.24.build.flags.optimize=-Os
teensy31.menu.speed.24.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.16.build.fcpu=16000000
teensy31.menu.speed.16.build.flags.optimize=-Os
teensy31.menu.speed.16.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.8.build.fcpu=8000000
teensy31.menu.speed.8.build.flags.optimize=-Os
teensy31.menu.speed.8.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.4.build.fcpu=4000000
teensy31.menu.speed.4.build.flags.optimize=-Os
teensy31.menu.speed.4.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.2.build.fcpu=2000000
teensy31.menu.speed.2.build.flags.optimize=-Os
teensy31.menu.speed.2.build.flags.ldspecs=--specs=nano.specs

teensy31.menu.keys.en-us=US English
teensy31.menu.keys.en-us.build.keylayout=US_ENGLISH
teensy31.menu.keys.fr-ca=Canadian French
teensy31.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensy31.menu.keys.xx-ca=Canadian Multilingual
teensy31.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensy31.menu.keys.cz-cz=Czech
teensy31.menu.keys.cz-cz.build.keylayout=CZECH
teensy31.menu.keys.da-da=Danish
teensy31.menu.keys.da-da.build.keylayout=DANISH
teensy31.menu.keys.fi-fi=Finnish
teensy31.menu.keys.fi-fi.build.keylayout=FINNISH
teensy31.menu.keys.fr-fr=French
teensy31.menu.keys.fr-fr.build.keylayout=FRENCH
teensy31.menu.keys.fr-be=French Belgian
teensy31.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensy31.menu.keys.fr-ch=French Swiss
teensy31.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensy31.menu.keys.de-de=German
teensy31.menu.keys.de-de.build.keylayout=GERMAN
teensy31.menu.keys.de-dm=German (Mac)
teensy31.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensy31.menu.keys.de-ch=German Swiss
teensy31.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensy31.menu.keys.is-is=Icelandic
teensy31.menu.keys.is-is.build.keylayout=ICELANDIC
teensy31.menu.keys.en-ie=Irish
teensy31.menu.keys.en-ie.build.keylayout=IRISH
teensy31.menu.keys.it-it=Italian
teensy31.menu.keys.it-it.build.keylayout=ITALIAN
teensy31.menu.keys.no-no=Norwegian
teensy31.menu.keys.no-no.build.keylayout=NORWEGIAN
teensy31.menu.keys.pt-pt=Portuguese
teensy31.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensy31.menu.keys.pt-br=Portuguese Brazilian
teensy31.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensy31.menu.keys.rs-rs=Serbian (Latin Only)
teensy31.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensy31.menu.keys.es-es=Spanish
teensy31.menu.keys.es-es.build.keylayout=SPANISH
teensy31.menu.keys.es-mx=Spanish Latin America
teensy31.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensy31.menu.keys.sv-se=Swedish
teensy31.menu.keys.sv-se.build.keylayout=SWEDISH
teensy31.menu.keys.tr-tr=Turkish (partial)
teensy31.menu.keys.tr-tr.build.keylayout=TURKISH
teensy31.menu.keys.en-gb=United Kingdom
teensy31.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensy31.menu.keys.usint=US International
teensy31.menu.keys.usint.build.keylayout=US_INTERNATIONAL

teensy31.menu.ser_sz.def=Default (40/64)
teensy31.menu.ser_sz.def.build.sersize=SERIAL_SIZE_DEFAULT
teensy31.menu.ser_sz.256-all=All 256 Bytes
teensy31.menu.ser_sz.256-all.build.sersize=ALL_SERIAL_SIZE_256
teensy31.menu.ser_sz.256-1=Serial1 256 Bytes
teensy31.menu.ser_sz.256-1.build.sersize=SERIAL1_SIZE_256
teensy31.menu.ser_sz.256-2=Serial2 256 Bytes
teensy31.menu.ser_sz.256-2.build.sersize=SERIAL2_SIZE_256
teensy31.menu.ser_sz.256-3=Serial3 256 Bytes
teensy31.menu.ser_sz.256-3.build.sersize=SERIAL3_SIZE_256
teensy31.menu.ser_sz.256-4=Serial4 256 Bytes
teensy31.menu.ser_sz.256-4.build.sersize=SERIAL4_SIZE_256
teensy31.menu.ser_sz.256-5=Serial5 256 Bytes
teensy31.menu.ser_sz.256-5.build.sersize=SERIAL5_SIZE_256
teensy31.menu.ser_sz.256-6=Serial6 256 Bytes
teensy31.menu.ser_sz.256-6.build.sersize=SERIAL6_SIZE_256
